# InsideGap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPHiddenLineSettings..::..InsideGap Property
MEPHiddenLineSettings Class See Also
---
The gap for the lines that appear within a crossing segment.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double InsideGap { get; set; }
```

Visual Basic
---
```text
Public Property InsideGap As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double InsideGap {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The gap size must be between 0" and 3/4". |

# See Also
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace